; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-6nodes-1000size-5degree-100mindistance-2trucks-3packages-443seed

(define (problem transport-city-sequential-6nodes-1000size-5degree-100mindistance-2trucks-3packages-443seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  city-loc-4 - location
  city-loc-5 - location
  city-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 193,461 -> 604,511
  (road city-loc-2 city-loc-1)
  (= (road-length city-loc-2 city-loc-1) 42)
  ; 604,511 -> 193,461
  (road city-loc-1 city-loc-2)
  (= (road-length city-loc-1 city-loc-2) 42)
  ; 31,904 -> 193,461
  (road city-loc-3 city-loc-2)
  (= (road-length city-loc-3 city-loc-2) 48)
  ; 193,461 -> 31,904
  (road city-loc-2 city-loc-3)
  (= (road-length city-loc-2 city-loc-3) 48)
  ; 367,912 -> 604,511
  (road city-loc-4 city-loc-1)
  (= (road-length city-loc-4 city-loc-1) 47)
  ; 604,511 -> 367,912
  (road city-loc-1 city-loc-4)
  (= (road-length city-loc-1 city-loc-4) 47)
  ; 367,912 -> 193,461
  (road city-loc-4 city-loc-2)
  (= (road-length city-loc-4 city-loc-2) 49)
  ; 193,461 -> 367,912
  (road city-loc-2 city-loc-4)
  (= (road-length city-loc-2 city-loc-4) 49)
  ; 367,912 -> 31,904
  (road city-loc-4 city-loc-3)
  (= (road-length city-loc-4 city-loc-3) 34)
  ; 31,904 -> 367,912
  (road city-loc-3 city-loc-4)
  (= (road-length city-loc-3 city-loc-4) 34)
  ; 873,676 -> 604,511
  (road city-loc-5 city-loc-1)
  (= (road-length city-loc-5 city-loc-1) 32)
  ; 604,511 -> 873,676
  (road city-loc-1 city-loc-5)
  (= (road-length city-loc-1 city-loc-5) 32)
  ; 873,676 -> 367,912
  (road city-loc-5 city-loc-4)
  (= (road-length city-loc-5 city-loc-4) 56)
  ; 367,912 -> 873,676
  (road city-loc-4 city-loc-5)
  (= (road-length city-loc-4 city-loc-5) 56)
  ; 255,851 -> 604,511
  (road city-loc-6 city-loc-1)
  (= (road-length city-loc-6 city-loc-1) 49)
  ; 604,511 -> 255,851
  (road city-loc-1 city-loc-6)
  (= (road-length city-loc-1 city-loc-6) 49)
  ; 255,851 -> 193,461
  (road city-loc-6 city-loc-2)
  (= (road-length city-loc-6 city-loc-2) 40)
  ; 193,461 -> 255,851
  (road city-loc-2 city-loc-6)
  (= (road-length city-loc-2 city-loc-6) 40)
  ; 255,851 -> 31,904
  (road city-loc-6 city-loc-3)
  (= (road-length city-loc-6 city-loc-3) 23)
  ; 31,904 -> 255,851
  (road city-loc-3 city-loc-6)
  (= (road-length city-loc-3 city-loc-6) 23)
  ; 255,851 -> 367,912
  (road city-loc-6 city-loc-4)
  (= (road-length city-loc-6 city-loc-4) 13)
  ; 367,912 -> 255,851
  (road city-loc-4 city-loc-6)
  (= (road-length city-loc-4 city-loc-6) 13)
  (at package-1 city-loc-4)
  (at package-2 city-loc-4)
  (at package-3 city-loc-4)
  (at truck-1 city-loc-5)
  (capacity truck-1 capacity-2)
  (at truck-2 city-loc-5)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-loc-5)
  (at package-2 city-loc-3)
  (at package-3 city-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-loc-5 city-loc-4)
   deleted: (at truck-1 city-loc-5)
   added: (at truck-1 city-loc-4)
   goals met: 0 of 3
2. (pick-up truck-1 city-loc-4 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-loc-4) (capacity truck-1 capacity-2)
   added: (in package-3 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 3
3. (pick-up truck-1 city-loc-4 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-loc-4) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 3
4. (drive truck-1 city-loc-4 city-loc-1)
   deleted: (at truck-1 city-loc-4)
   added: (at truck-1 city-loc-1)
   goals met: 0 of 3
5. (drop truck-1 city-loc-1 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-0)
   added: (at package-3 city-loc-1) (capacity truck-1 capacity-1)
   goals met: 1 of 3
6. (drive truck-1 city-loc-1 city-loc-5)
   deleted: (at truck-1 city-loc-1)
   added: (at truck-1 city-loc-5)
   goals met: 1 of 3
7. (drive truck-2 city-loc-5 city-loc-4)
   deleted: (at truck-2 city-loc-5)
   added: (at truck-2 city-loc-4)
   goals met: 1 of 3
8. (drop truck-1 city-loc-5 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-1)
   added: (at package-1 city-loc-5) (capacity truck-1 capacity-2)
   goals met: 2 of 3
9. (pick-up truck-2 city-loc-4 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-loc-4) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 2 of 3
10. (drive truck-2 city-loc-4 city-loc-3)
   deleted: (at truck-2 city-loc-4)
   added: (at truck-2 city-loc-3)
   goals met: 2 of 3
11. (drop truck-2 city-loc-3 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-1)
   added: (at package-2 city-loc-3) (capacity truck-2 capacity-2)
   goals met: 3 of 3
